cmd_powerdown

<?xml version="1.0" encoding="UTF-8" ?>
<soap:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:soapenc="http://schemas.xmlsoap.org/soap/encoding/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" soap:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/" xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
<soap:Body>
  <RemoteControl xmlns="http://schemas.intel.com/platform/client/RemoteControl/2004/01">
    <Command>18</Command>
    <IanaOemNumber>343</IanaOemNumber>
  </RemoteControl>
</soap:Body>
</soap:Envelope>
